
//
//
//  General text
//
//


/* initial parent bird text */

"initial parent text" = " ";

/* father */

"father" = "Father";

/* mother */

"mother" = "Mother";

/* male chicks */

"male chicks" = "Male chicks";

/* female chicks */

"female chicks" = "Female chicks";

/* parents */

"parents" = "Parents";

/* split to */

"split to" = " split to";

/* single factor */

"single factor" = " (single factor)";

/* double factor */

"double factor" = " (double factor)";

//
//
// Buttons
//
//


/* View Breeding Results button */

"view breeding results" = "Show This Pair's Chicks";

/* Reset button */

"reset" = "Reset to Normal Grey";

/* mutations (tab bar) */

"mutations" = "Mutations";

/* help topics (tab bar) */

"help topics" = "Help Topics";

/* Virtual Breeder (tab bar) */

"virtual breeder" = "Virtual Breeder";

/* none (mutation select) */

"none" = "None";

/* split (mutation select) */

"split" = "Split";

/* visual (mutation select) */

"visual" = "Visual";



//
//
// Page and Section Headers
//
//

/* select parents' types (virtual breeder main) */

"select parents types" = "Parents' Types\n(Tap below to select mutations)";

/* recessive mutations section header (select screen) */

"recessive mutations" = "Recessive mutations";

/* parblue section header (select screen) */

"parblue mutations" = "Parblue mutations (recessive)";

/* sex-linked mutations section header (select screen) */

"sex-linked mutations" = "Sex-linked Mutations";

/* dominant mutations section header (select screen) */

"dominant mutations" = "Dominant mutations";

/* dominant mutations header line 2 (select screen) */

"df sf" = "DF: Double Factor; SF: Single Factor";

/* crossovers male chicks */

"crossovers male chicks" = "Crossovers: male chicks";

/* crossovers female chicks */

"crossovers female chicks" = "Crossovers: female chicks";


 


//
//
//  Mutation Descriptions
//
//

/* Normal Grey Description */
"grey_desc" = "This is the coloration of wild cockatiels, and it is dominant to all color mutations (except dominant silver and dominant yellowcheek).  All mutations are variations of normal grey plumage, and are caused by dilution, intensification, or absence of the colors found in greys.  \n\n The bird pictured is a male, which is evident from his clear yellow face and bright red cheek patch.  Female greys have grey faces and more indistinct cheek patches.";

/* Cinn/Fallow Description */

"cinnfallow_desc" = "Cinnamon cockatiels (shown on the right) have grey-brown feathers instead of the dark grey feathers of a normal bird.  Their eyes are a dark purplish-red, and their beaks and feet are greyish.  Cinnamon is a sex-linked mutation.\n\nFallow cockatiels (on the left) are similar to cinnamons, but their eyes are red, their beaks and feet are pink, and their brown feathers are paler and yellower than cinnamons'.  Fallow is a recessive mutation.";

/* Pied Description */

"pied_desc" = "Pied birds have random areas of plumage that contain no melanin, and therefore areas of their grey plumage are replaced with yellow (most pied cockatiels have more yellow feathers than grey ones).  They have dark eyes, which can distinguish the heaviest pieds (birds with no grey feathers, or clear pieds) from lutinos.  This mutation is recessive.";

/* Lutino Description */

"lutino_desc" = "All melanin (grey or brown coloration) is absent from lutino cockatiels' plumage, resuting in a white bird with the usual yellow face and orange cheek patch.  Their eyes are red, and their beaks and feet are pink.  The red eyes of the lutino can distinguish it from a clear pied (a pied bird that has no grey markings), which would have dark eyes.  \n\n Breeders should be aware that combining lutino with cinnamon, which should result in a bird that looks like a lutino (since the absence of melanin should eliminate all cinnamon coloration), instead produces a dirty lutino -- the white feathers retain a tiny amount of melanin, which makes them look dirty.  \n\n Lutino is a sex-linked mutation.";

/* Olive Description */

"olive_desc" = "Olive, a recessive mutation, is still relatively rare.  Olive birds have light grey feathers with a heavy yellow wash, making the feathers appear almost greenish.  There seems to be some variation in the lightness of the grey among different birds -- some are much paler than others.  Olive birds also have a slightly scalloped pattern on their wing feathers; the edges of these feathers are darker, fading into slightly paler centers.";

/* Parblue Description */

"parblue_desc" = "Creamface, pastelface, and whiteface are three recessive mutations that make up the parblue, or partial-blue, series.  All three mutations affect the gene that controls the amount of yellow in a cockatiel's plumage.  \n\nThe whiteface mutation (pictured at the bottom) removes all yellows and reds from the plumage, giving affected birds a pure-white face.  Combining fallow or olive with whiteface removes the characteristic yellow wash from these colors; whiteface fallows look like pale whiteface cinnamons, and whiteface olives lose their greenish tinge while retaining the slight scalloped pattern on their wing feathers.\n\nPastelface cockatiels (pictured on the left) have a reduced amount of yellow and red in their plumage, giving their cheek patches a pastel peach appearance.\n\nCreamface (top right), which is a newer mutation and still quite rare, reduces the yellow and red pigments even more than pastelface, leaving just a hint of cream in the cheek patch, and an otherwise whitish face.";

/* Pearl Description */

"pearl_desc" = "The pearl mutation, which is sex-linked, removes the melanin from the centers of all grey feathers, giving the affected plumage a scalloped appearance.  While females retain this coloration throughout their lives, most males lose the pearl markings after their first molt, after which they look like dark normal grey birds.  \n\n This mutation can be combined with others to change the appearance of the pearl markings; a cinnamon pearl, for example, will have brown edgings on the scalloped feathers, and a whiteface pearl's feathers will have white centers rather than yellow ones.";

/* Silver Description */

"silver_desc" = "There are two types of silver mutations: dominant (on the left) and recessive (right).  Both types of birds have a silvery grey appearance, which is caused by a reduction of melanin (the material that produces greys and browns) in their feathers.  \n\n A dominant silver cockatiel can be either a single-factor (it has only one copy of the affected gene) or a double-factor (it has two copies).  Double-factors are lighter than single-factors, just as if they had a double dose of melanin reduction.  Both types have dark eyes, beaks and feet, and a dark grey skullcap.  Recessive silver birds, on the other hand, are uniformly silver-grey, with red eyes and pink feet and beaks.";

/* Yellowcheek Description */

"yellowcheek_desc" = "Yellowcheek cockatiels have yellow cheek patches rather than orange ones.  Only the orange patches are affected in this mutation, which comes in two forms: sex-linked and dominant.  Dominant yellowcheek is inherited in the same way as dominant silver, although there does not seem to be any visible difference between a single-factor and a double-factor dominant yellowcheek, or between a dominant yellowcheek and a sex-linked yellowcheek.";


//
//
//  Mutation names
//
//


/* grey name */

"normal grey" = "normal grey";

/* cinnamon name */

"cinnamon" = "cinnamon";

/* fallow name */

"fallow" = "fallow";

/* lutino name */

"lutino" = "lutino";

/* olive name */

"olive" = "olive";

/* pearl name */

"pearl" = "pearl";

/* pied name */

"pied" = "pied";

/* recessive silver name */

"recessive silver" = "recessive silver";

/* dominant silver name */

"dominant silver" = "dominant silver";

/* dominant yellowcheek name */

"dominant yellowcheek" = "dominant yellowcheek";

/* sl yellowcheek name */

"sex-linked yellowcheek" = "sex-linked yellowcheek";

/* creamface name */

"creamface" = "creamface";

/* pastelface name */

"pastelface" = "pastelface";

/* whiteface name */

"whiteface" = "whiteface";

/* silver combo name */
"silver: dominant and recessive" = "silver: dominant and recessive";

/* yellowcheek combo name */

"yellowcheek: dominant and sex-linked" = "yellowcheek: dominant and sex-linked";

/* parblue combo name */

"parblue: creamface, pastelface, and whiteface" = "parblue: creamface, pastelface, and whiteface";



//
//
//  Help Sections
//
//


//
//
// Main Help Sections
//
//



/* genetics lesson */

"Genetics lesson title" = "Genetics Lesson";

/* FAQ */

 "FAQ title" = "Frequently Asked Questions";

/* parblue topics */

"parblue topics title" = "About Parblue";

/* mutations */

"mutations title" = "North American Mutations";


//
//
// FAQ
//
//

/* why no albino */

"Why isn't \"albino\" an option in the Virtual Breeder" = "Why isn't \"albino\" an option in the Virtual Breeder?\n\nThere is no true albino mutation in cockatiels (yet). Whereas a true albino cockatiel would be the result of a single mutation, the all-white cockatiels that are often called albinos are actually the result of combining the whiteface and lutino mutations -- the two mutations work together to remove all pigment from the bird, just as a true albino mutation would.";

/* why no albino title */

"Why isn't \"albino\" an option in the Virtual Breeder title" = "Why isn't \"Albino\" an Option in the Virtual Breeder?";

/* unexpected results */

"Why don't my chicks match the virtual breeder's results" = "Why Don't my Chicks' Types Match the Virtual Breeder's Results?\n\nSometimes you will see chicks in the nest box that you don't see on the results page. There are three main reasons that this happens:\n\nThe parent birds carry unknown splits.\nIf you have two greys, the Virtual Breeder will tell you that all of your pair's chicks will be grey. If their chicks, to your surprise, are fallow, pearl, and whiteface (just as an example), you know that your tiels have been hiding something from you -- their splits. If you aren't familiar with your pair's parentages, they may be split to any number of mutations, and you won't have any way of knowing until they produce chicks with mutations you didn't expect. Once you see \"new\" mutations in the chicks, you can deduce what the parents' splits must be. For example, if two greys produce a pearl chick, you know that the male grey must be split to pearl (and the pearl chick must be female). If the greys then produce a whiteface chick, you know that both parents must also be split to whiteface. This kind of detective work can get complicated, but it's fun... well, in my opinion, anyway!\n\nProbability isn't an exact science.\nIf the Virtual Breeder is telling you that you'll get pied chicks 50% of the time, but none of your pair's 8 chicks are pied, that's just one of the quirks of probability. The parent birds' genes combine randomly to create each chick, and even though we can predict that a certain combination will occur 25% of the time, it might happen 90% of the time, or it might never happen. Theoretically, the more chicks a pair produces, the more closely the chicks' types will reflect the percentages expressed by probability. If your pair has a million chicks, you may well see that almost exactly 50% of the chicks are pied. But then you'd have to find homes for a million chicks.";

/* unexpected results title */

"Why don't my chicks match the virtual breeder's results title" = "Why Don't my Chicks' Types Match the Virtual Breeder's Results?";


//
//
// Breeder instructions
//
//


/* how to use the virtual breeder title */

"How to use the virtual breeder title" = "How to Use the Virtual Breeder";

/* breeder instructions */

"How to use the virtual breeder" = "How to Use the Virtual Breeder\n\nBegin by selecting the color mutations of the parent birds. Tapping each parent's description will bring you to a complete list of North American color mutations, and you can then select the mutations that your bird carries.\n\nOnce you have finished entering the bird's type, tap \"Done\" to return to the main screen, where an icon below each parent's description will show its appearance (these icons are general illustrations and may not match your bird's actual coloring).\n\nAfter selecting both parents' types, tapping the \"View Breeding Results\" button will display a list of all the types of chicks that can be produced by the given pairing. To make changes to a parent's type, or to enter a new pairing, select \"Done\" to return to the main page.\n\nFor more information about genetics, mutations, and unfamiliar terms used in the Virtual Breeder, explore the Help Topics section.";






//
//
// Parblue
//
//


/* what does parblue mean */

"What does \"parblue\" mean?" = "What Does \"Parblue\" Mean?\n\nThe word \"parblue\" refers to the pastelface-creamface-whiteface series of mutations, which reduce the level of yellow pigment in the cockatiels' plumage.  Many wild-type parrots have green plumage due to a combination of feather structure and pigments; melanin and structure produce blue feathers, which combine with yellow pigments to create green plumage.  A total lack of yellow pigments, then, results in a bird that is blue rather than green, and a reduction of yellow pigment creates varying shades of bluish-green, thus the term \"partial blue,\" or parblue.  \n\nCockatiels' feathers lack the structural features needed to produce blue, and yellow/red pigments tend to be confined to the face, so the mutations that would cause a blue or partial-blue appearance in other parrots instead produce a grey-bodied bird with a white or pale-yellow face.  \n\nAlthough \"reduced-yellow\" describes the actual appearance of these cockatiels better than \"parblue,\" it's better to stick with a term that's accepted by parrot breeders instead of inventing something new.  If the experts can agree on a better label for these mutations, the Virtual Breeder's terminology will be updated.";

/* what is parblue title */

"What does \"parblue\" mean title" = "What does \"Parblue\" Mean?";

/* what are the parblue mutations */

"What are the parblue mutations?" = "What are the Parblue Mutations?\n\nThere are three mutations in the parblue series: pastelface, creamface, and whiteface.  All of these mutations reduce yellow and red pigments to different degrees; pastelface reduces the appearance of these pigments by about 50%, creamface by about 90%, and whiteface eliminates these pigments completely (these percentages are just estimates).  Because all of these mutations affect the same gene, which will be called the \"parblue gene\" in this program for the sake of clarity, they interact differently than other mutations, which can be very confusing for breeders who are just learning about genetics.  \n\n As you learned in this program's genetics lesson, autosomal (non-sex-linked) genes come in pairs, and the parblue genes are autosomal.  This means that a bird can carry a maximum of two mutations from the parblue series: one creamface and one pastelface mutation, or two whiteface mutations, or one normal gene and one pastelface mutation, just to name a few possibilities.  As long as a bird carries two mutated copies of the parblue gene -- even if the two mutations are not the same -- the bird will not be normal grey.  Instead, the bird will have the appearance, or phenotype, of the \"yellowest\" of the two mutations it carries.  A bird carrying one pastelface and one creamface mutation, then, will look exactly like a pastelface; a bird with one whiteface and one creamface mutation will look like a creamface.";

/* what are the parblue mutations title */

"What are the parblue mutations title" = "What are the Parblue Mutations?";

/* parblue in the breeder */

"How do I enter parblue types in the Virtual Breeder" = "How do I Enter Parblue Types in the Virtual Breeder?  \n\n When selecting your parent birds' types in the Virtual Breeder, you will be able to select up to two parblue mutations.  First, select the bird's phenotype (visual appearance) in the top series of buttons, and the application will automatically set the second button to match the first.  If your bird is carrying two different parblue mutations, select the second mutation in the lower button.";

/* parblue in the breeder title */

"How do I enter parblue types in the Virtual Breeder title" = "How do I Enter Parblue Types in the Virtual Breeder?";

/* phenotype explanation */

"What does \"phenotype\" mean?" = "What does \"Phenotype\" Mean?\n\nThe short answer is this: \"phenotype\" means \"physical appearance\". So why do we use this term instead of \"visual,\" which is more familiar?\n\n The parblue section is different from the other mutation sections in the Virtual Breeder because the three parblue mutations affect one gene. The Virtual Breeder uses the terms \"visual\" and \"split\" to describe recessive mutations, but these terms don't accurately describe how the parblue mutations interact, which can make things a little confusing. \n\nJust as a bird with two copies of the pied mutation is known as a visual pied, a bird with two copies of the pastelface mutation is a visual pastelface.   A cockatiel with one copy of the pied mutation is split to pied, and will be a visual normal grey; a bird with one pastelface mutation and one creamface mutation, however, is split to pastelface and creamface, but is still a visual pastelface.  To account for these two different kinds of visual pastelface, the term \"phenotype,\" or appearance, is used in the Virtual Breeder.\n\nA bird that carries two different parblue mutations will have those mutations listed as splits, with a note indicating the phenotype produced by the two parblue mutations.  For example, you may see a bird listed as \"Normal grey split to pastelface whiteface (phenotype: pastelface)\".  Even though the bird is not truly a visual normal grey, we need a way to show that the bird can pass one pastelface mutation or one whiteface mutation on to its offspring -- calling the bird a visual pastelface split to whiteface implies that the bird has two copies of pastelface and one copy of whiteface, which is impossible.";

/* phenotype explanation title */

"What does \"phenotype\" mean title" = "What does \"Phenotype\" Mean?";


//
//
// Genetics Lesson
//
//


/* what is a mutation */

"What is a mutation?" = "What is a Mutation?\n\nA mutation is a change in a piece of genetic material.  Some mutations have little or no effect on an organism, while others can cause dramatic change or even be fatal. \n\nCockatiel color variations occur when mutations change the levels of melanin (which produces browns, blues, and greys) and lipochromes (which produce yellows and reds) in the birds' feathers. Some of these mutations eliminate melanin or lipochromes completely, as in lutino and whiteface; some change the intensity or tone of a color, including cinnamon, yellowcheek, and silver; and others change the feather patterns, such as pearl and pied.";

/* what is a mutation title */

"What is a mutation title" = "What is a Mutation?";


/* how are the mutations inherited */

"How are the mutations inherited?" = "How are the Mutations Inherited?\n\nGenes come in pairs; a pair is composed of a gene from each parent.  A mutation can affect both copies of the gene, only one copy, or neither.  The different combinations of gene pairs alter the way in which the mutation affects the bird; the effects of these combinations are determined by whether the mutation is dominant, recessive, or sex-linked.\n\nA dominant mutation needs only to be present in one copy of a gene to change a bird's appearance.  Normal grey (which is not considered to be a mutation, but the wild coloration of a cockatiel) is dominant to all recessive and sex-linked colors.  The two true dominant mutations are dominant silver and dominant yellowcheek.  A bird with one dominant silver gene will appear silver, and is called a single-factor bird.  A cockatiel with two copies of the gene is called a double-factor.  The two forms can be told apart visually; a double-factor is much paler than a single-factor (think of the double-factor as having inherited a double dose of melanin reduction).  Dominant yellowcheek is inherited in the same way as dominant silver, but single-factor and double-factor birds cannot be visually told apart.\n\nA recessive mutation must affect both copies of a gene in order to change the bird's appearance; a visually pied cockatiel must have inherited a copy of the pied gene from each of its parents.  A bird that possesses only one copy of a recessive gene is called a split, and will pass that mutation on to half of its offspring.  Most splits will not show any sign of the hidden mutation, although cockatiels that are split to pied will often have a patch of yellow feathers on the backs of their necks.\n\nA sex-linked mutation is one that is carried on one of the sex chromosomes.  When dealing with sex-linked mutations in birds, it is important to note that humans' and birds' sex chromosomes do not work in the same way.  While a human female is homozygous (which means that she has two copies of the same sex chromosome -- \"XX\) and a male human is heterozygous (\"XY\"), it is the other way around in birds; female birds are heterozygous, and males are homozygous.\n\nThis means that females can have only one copy of a sex-linked mutation (the mutation is carried on the X chromosome), and it follows that females cannot be split to a sex-linked mutation.  If a female does not visually display the sex-linked trait, she does not carry it at all.";

/* how are the mutations inherited title */

"How are the mutations inherited title" = "How are the Mutations Inherited?";

/* what is a crossover */

"What is a crossover?" = "What is a Crossover?\n\nA genetic crossover occurs when a male bird's two X chromosomes swap genetic material, moving a mutation from one X chromosome to the other.\n\nA male cockatiel inherits one X chromosome from his father (let's call this chromosome \"X1\") and the other from his mother (\"X2\").  Each of these chromosomes can carry sex-linked mutations, and the mutations on each X chromosome are always inherited together, so the mutations on X1 will travel together to the next generation (likewise for the ones on X2).\n\nLet's say that a lutino male and a cinnamon pearl female have one male chick.  One of the chick's X chromosomes (X1) will carry lutino (from his father), and the other (X2) will carry cinnamon and pearl (from his mother):\n\nX1: lutino\nX2: cinnamon pearl\n\nIf this male is mated to a grey female, these are the possible results:\n\nMale chicks:\n50% grey split to cinnamon pearl (if they inherit X2)\n50% grey split to lutino (if they inherit X1)\n\nFemale chicks:\n50% cinnamon pearl (if they inherit X2)\n50% lutino (if they inherit X1)\n\nNote that, according to this model, it is not possible for any of the female chicks to be just pearl, just cinnamon, or lutino pearl.  She is limited to the combination of mutations on the single X chromosome she inherits.\n\nCrossovers occur in individual gametes when the male produces sperm.  In the example above, it would be possible for the two X chromosomes to switch some genetic material and thus swap mutations, leaving, for example, pearl on X2 and transferring cinnamon to X1 (meaning that X1 would then carry both cinnamon and lutino).  The affected gamete would then produce either a cinnamon lutino hen or a pearl hen (if the resulting chick were male, it would be split to pearl or cinnamon lutino).  If you know a male's parentage and find that his chicks carry unexpected combinations of sex-linked mutations, a crossover is the cause.  The rate of crossovers seems to vary from mutation to mutation, but it can be as high as 30%.";

/* what is a crossover title */

"What is a crossover title" = "What is a Crossover?";

/* what do x1 and x2 mean */

"What do X1 and X2 mean?" = "What do X1 and X2 Mean?\n\nIf the male you enter is split to one or more sex-linked mutations, the breeder will let you specify which of the male's two X chromosomes contain these mutations (this applies only to splits, since a visual sex-linked mutation occupies both chromosomes). \n\nFor the sake of order, let's say that X1 is the chromosome he inherited from his father, and X2 is the one he got from his mother. If he only has one sex-linked mutation, it doesn't matter whether you put it on X1 or X2 -- the results will be the same. Of course, if you know that your male is the result of a crossover, assign the mutations accordingly. In the list of results, each sex-linked split mutation will be followed by the X chromosome it occupies.";

/* what do x1 and x2 mean  title */

"What do X1 and X2 mean title" = "What do X1 and X2 Mean?";

/* about page */

"about full text" = "Hello!\n\nI'm Kirsten Anderson, a Seattle-based graphic designer, illustrator, and programmer.\n\nEver since my own experience as a hobby cockatiel breeder as a teenager, I have had an interest in color mutations and genetics. I created the Cockatiel Color Palette in 2000 as a coding/design project at Art Center College of Design. Over the years, the site's audience has grown and browser support for the Shockwave plug-in has waned, so I'm pleased to offer an iOS Cockatiel Color Palette app with a new look and even more functionality!\n\nPlease feel free to send a message to kirsten@kirstenmunson.com with any questions, comments, or suggestions you may have. I always enjoy hearing from you!\n\nMy portfolio site: www.kirstenmunson.com\n\nCockatiel Color Palette on Facebook: www.facebook.com/cockatielcolorpalette";


